
read -p "是否不混淆代码？（输入yes不混淆）：" isRelease
if [ $isRelease = "yes" ]
then
	echo "\033[2J \033[32m ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░ 开始生成 测试包 ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░ \033[0m"
	webpack --progress --env package
	echo "\033[32m ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░ 测试包 生成完毕 ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░ \033[0m"
else
	echo "\033[2J \033[32m ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░ 开始生成 生产包 ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░ \033[0m"
	webpack --progress -p --env package
	echo "\033[40;36m \033[5m ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░ 生产包 生成完毕 ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░ \033[0m"
fi
